Revit 2027 API
Viewport.GetLabelOutline Method
 Gets the outline viewport's label on the sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Outline GetLabelOutline()
Public Function GetLabelOutline As Outline
public:
Outline^ GetLabelOutline()
member GetLabelOutline : unit -> Outline
Return Value
Outline
 The outline of the viewport's label on the sheet. The outline may be empty if there is no label.
Exceptions
Exception | Condition
InvalidOperationException |  The viewport is not on a sheet.
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace